# DataFrame Class

In [2]:
import numpy as np
import pandas as pd

##생성

In [7]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df
df.지역.values

array(['수도권', '경상권', '수도권', '경상권'], dtype=object)

In [8]:
df['2015'].values

array([9904312, 3448737, 2890451, 2466052])

In [10]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [11]:
df.index.name = '서울'

In [12]:
#전치
df.T

서울                  서울       부산       인천       대구
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [5]:
data = np.arange(24).reshape(4,6)
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    지역  2015  2010  2005  2000  2010-2015 증가율
서울   0     1     2     3     4              5
부산   6     7     8     9    10             11
인천  12    13    14    15    16             17
대구  18    19    20    21    22             23

## 열데이터의 갱신, 추가, 삭제

In [14]:
df['2010-2015 증가율'] = df['2010-2015 증가율']*100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
서울  수도권  9904312  9631482  9762546  9853972          283.0
부산  경상권  3448737  3393191  3512547  3655437          163.0
인천  수도권  2890451  2632035  2517680  2466338          982.0
대구  경상권  2466052  2431774  2456016  2473990          141.0

In [19]:
df['2020'] = [1, 2, 3, 4]
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2020
서울
서울  수도권  9904312  9631482  9762546  9853972          283.0     1
부산  경상권  3448737  3393191  3512547  3655437          163.0     2
인천  수도권  2890451  2632035  2517680  2466338          982.0     3
대구  경상권  2466052  2431774  2456016  2473990          141.0     4

In [20]:
del df['2020']
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
서울  수도권  9904312  9631482  9762546  9853972          283.0
부산  경상권  3448737  3393191  3512547  3655437          163.0
인천  수도권  2890451  2632035  2517680  2466338          982.0
대구  경상권  2466052  2431774  2456016  2473990          141.0

In [21]:
df['지역']  #결과는 Series

서울
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [23]:
df[['지역', '2015']]

     지역     2015
서울
서울  수도권  9904312
부산  경상권  3448737
인천  수도권  2890451
대구  경상권  2466052

In [25]:
df[['지역']] #결과는 데이터프레임

     지역
서울
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [28]:
type(df['지역']), type(df[['지역']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

##행인덱싱

In [30]:
df[:'서울']

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
서울  수도권  9904312  9631482  9762546  9853972          283.0

In [31]:
df[1:2]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
부산  경상권  3448737  3393191  3512547  3655437          163.0

In [33]:
df['부산':'인천']

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
부산  경상권  3448737  3393191  3512547  3655437          163.0
인천  수도권  2890451  2632035  2517680  2466338          982.0

In [35]:
df.head(3)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울
서울  수도권  9904312  9631482  9762546  9853972          283.0
부산  경상권  3448737  3393191  3512547  3655437          163.0
인천  수도권  2890451  2632035  2517680  2466338          982.0

##개별 데이터 인덱싱
- df['열 이름']['행 이름']

In [36]:
df['2015']['서울']

9904312

In [37]:
df['2015'][0]

9904312

연습문제 4.1.3

In [39]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [42]:
df['수학'],  # df.수학

(춘향    90
 몽룡    60
 향단    80
 방자    70
 Name: 수학, dtype: int64, 춘향    90
 몽룡    60
 향단    80
 방자    70
 Name: 수학, dtype: int64)

In [43]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [53]:
#3)평균을 새로운 열로 추가
df['평균'] = np.mean(df.values, axis=1).round(1)

In [54]:
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [55]:
df.mean(axis=1)

춘향    86.675
몽룡    73.325
향단    70.000
방자    46.675
dtype: float64

In [57]:
del df['평균']
df

KeyError: ignored

In [64]:
df['영어'][3] =80

df['평균'] = np.round(df.mean(axis=1), 1)
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [66]:
# 5.춘향의 점수를 데이터 프레임으로
df[:'춘향']

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [67]:
df.T['춘향']

국어    80.0
영어    90.0
수학    90.0
평균    86.7
Name: 춘향, dtype: float64

In [68]:
#중간에 있는 두 행 꺼내오기 
df.head(3).tail(2)

    국어  영어  수학    평균
몽룡  90  70  60  73.3
향단  70  60  80  70.0

In [69]:
# 6)향단의 점수를 시리즈로
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64